Revit 2024 API
ParameterTypeId.RbsCurveSurfaceArea Property
 "Area"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RbsCurveSurfaceArea { get; }
Visual Basic
Public Shared ReadOnly Property RbsCurveSurfaceArea As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RbsCurveSurfaceArea {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace